---
layout: post
title: "初级程序员如何去提高工作效率？"
subtitle: "为自己总结一套方法论"
author: "zy"
header-img: "img/post-bg-golang.jpg"
catalog: true
tags:
  - 方法论
---

## 引言

小时候《读者》，《意林》看得比较多，长大后很是反感这些所谓的提高工作效率的方法论，有一股浓浓的成功学味道。初入职场，一切事物都是新奇，脏活累活都是抢着干。一年半载后，有时候真是感觉身心俱疲，愈发意识到效率的重要性。鸡汤不可取，但为自己总结一套方法论却是极其重要的。故写下此文（会一直修正改动），一来可以为后面的工作学习做一些规划，二来可以勉励自己时常去反思总结，有着改正，无则加勉，真正地去提高工作效率。

## 学会休息

这里的休息应该是指两方面，那就是身体和心理。

##### 身体上的休息
首先是历史上某些人的水平一般，为什么也可以成为大师？就是因为他把同时代的人物都熬死了。程序员应该也是同样的道理，技术总会随着熟练程度的加深而有所精益（或多或少），但是岁月不饶人啊。论持久战的重要性，这是毛选早就已经告诉我们的真理。有时候思考一些问题或者代码写得正high，奋战至深夜，还有可能兴奋得睡不着。修仙（熬夜）也是讲究天赋的，天赋不行只能是学会养生，特别是程序猿这种高压行业。听妈妈的话：早睡早起，少油少盐，多喝水多运动。

##### 心理上的休息

有些人天生就是乐天派，天塌了都有个子高的人顶着。而我不行，从小学开始就是一个焦虑患者，危机感极强：会焦虑中年失业了还不起贷款，担心自己会生病，害怕完不成KPI, 最恐惧的还是宝贵的时光在和一堆业务方扯皮中渡过，技术上没有进步，没有安身立命之本。 